export interface Plant {
    label: string;
    name: string;
    image: any;
    description: string;
}

export const PLANTS_DATA: Plant[] = [
    {
        label: 'daisy',
        name: 'Дәрілік түймедақ',
        image: require('../assets/daisy.jpg'),
        description: 'Дәрілік түймедақ – биіктігі 35-40см –ге жететін бір жылдық шөптесін өсімдік, тамыры нәзік,білеу. Бірен-саран бұтақталған сабақтары бар, күрделі екі-үш қауырсынды тілімделген жапырақтары сабақтарында кезектесіп орналасқан.Тілімделген жапырақшалары жіңішке жіп тәрізді,төменгі жапырақтары сабақтарын жартылай қоршап жатады. \n\nГүлдері өте көп, себет немесе кәрзенке гүл шоғырын түзеді.Гүлдері тұтас немесе біршама үгітілген жартылай шар тәрізді гүлсебеттерден тұрады, гүл сағақтары 3см-ге дейін болады, кәрзенкелері шеткі тілше және ортанғы сары түтікше гүлдерден тұрады. Гүл тұғыры қуыс, жартылай шар тәрізді немесе конус тәрізді. Себеттердің тілше гүлдері ақ түсті, түтікше гүлдерінікі сары, иісі күшті жұпар иісті, дәмі татымды, ащылау.',
    },
    {
        label: 'dandelion',
        name: 'Бақбақ',
        image: require('../assets/dandelion.jpg'),
        description: 'Бақбақ (лат. Taraxacum) – астралылар тұқымдасына жататын көп жылдық, кейде бір не екі жылдық шөптесін өсімдіктер. Қазақстанда 59 түрі бар, оның 23-i сирек кездесетін эндемик өсімдіктер болып саналады. Ең көп тарағандары: дәрілік бақбағы (T. officinale), көксағыз бақбағы (T. kok-saghyz). Олар шалғынды, көгалды жерлерде, жол жиегінде, тау бөктерлерінде өседі. Биіктігі 4 — 30 см-дей, сабағы қуыс, жапырақсыз, тықыр, сүтті шырынды болады. \n\nЖапырақтары қауырсын пішіндес, жиегі тегіс, тамыр мойнына айнала шоғырланады. Гүлдері қос жынысты, сары түсті, тостағанша дөңгеленіп сабақ ұшында орналасады. Сәуір — мамыр айларында гүлдейді, мамыр — маусымда жеміс береді. Жемісі — дәнек, ол желмен тарайды. Бақбақтың тамыры мен сабағы дәрілік мақсатқа қолданылады, сондай-ақ, мал азығына, тағамға пайдаланылады.',
    },
    {
        label: 'nutsedge',
        name: 'Дөңгелек болыңыз',
        image: require('../assets/nutsedge.webp'),
        description: 'Жер асты түйнек тәрізді қалыңдатылған сабақтар, әдетте жалғыз, үшбұрышты, негізі зәйтүн, тегіс, биіктігі 10-40 см. Жапырақтары сызықты, көбінесе сабағынан қысқа, ені 2-4 мм. \n\nГүлшоғыры қолшатыр тәрізді, азды—көпті борпылдақ, ұзындығы 0,3-10 см тең емес сәулелермен, негізі 3-4 жапырақтары бар, олардың кейбіреулері гүлшоғырдан асады. Шпикелеттер ұзынша-сызықты, тар, өткір, тот басқан қызыл, ұзындығы 6-15 мм, ені 1-2 мм; жабын қабыршақтары жұмыртқа тәрізді, доғал, көбінесе өте қысқа ұшы бар, тот басқан немесе жасыл-тот басқан, жасыл кильмен және ашық жиегімен. Жемісі-үшбұрышты жаңғақ, қою сұр, ұзындығы 1,5 мм.',
    },
    {
        label: 'potato',
        name: 'Картоп',
        image: require('../assets/potato.jpg'),
        description: 'Бұл көпжылдық шөптесін өсімдік. Сабағы жуан, тікенексіз. Сабағының көп бөлігі топырақ астында болады. Ұзын мұртшалар шығарады (ұзындығы 15-20, кейбір түрлерінде 40-50 см). Жапырағы қою жасыл, сабақта кезектесіп орналасады. Гүлі ақ, күлгін түсті, сабақ басында шоғырланған болады, гүлі 5 күлтелі. Биіктігі 40 – 80 см, кейде 150 см-ге дейін жетеді. Бір түпте 3 – 6 сабақ болады. Гүлі ақ, қызғылт не көкшіл күлгін түсті. \n\nЖемісі екі ұялы, көп тұқымды. Жер астындағы өркен сабағының ұшы түйнекке айналады. Топырақ температурасы 5 – 8°С-та түйнек бүршік жара бастайды, түйнектің түзілуіне ең қолайлы температура 10 – 13°С, 20°С-та түйнек түзілу процесі тоқтайды. Ал –1 – 2°С суықта жас өскіндері үсіп кетеді. Вегетациялық кезеңі 70 – 120 тәулік. \n\nТұқымынан және түйнектен көбейеді. К. түйнегінде 23,7% құрғақ зат болады, оның ішінде: 17,5% крахмал, 0,5% қант, 1 – 2% ақуыз, 1%-ке жуық минералды тұздар, С, В1, В2, В6, РР, К витаминдері бар. Қазақстанда картоптың 20-дан астам сорттары аудандастырылған (оның ішінде 10-ы жергілікті селекциядан шыққан), 1 га-дан орта есеппен 100 – 200 ц өнім түседі. К. тағам, мал азығы және өнеркәсіпте тех. шикізат ретінде пайдаланылады.',
    },
    {
        label: 'purslane',
        name: 'Бақша қараоты',
        image: require('../assets/purslane.webp'),
        description: 'Бақша қараоты (лат. Portulaca olerаcea) - қараоттар тұқымдасы, қараот туысына жататын бір жылдық шөптесін өсімдік. Жер бетінде тропиктік және субтропиктік аймақтарында таралған. Қазақстанда Каспий маңында, Балқаш-Алакөл ойысында, Іле, Күнгей, Қырғыз Алатауларында кездседі. \n\nӨсетін жері - өзендердің құмды жайылымдары, егістіктер, бақшалар, алаңқайлар. Медицинада бақша қараотының дәні және жапырағынан жасалынған дәрілер бүйрек, бауыр, т.б.ауруларға қарсы ем үшін пайдаланылады.',
    }
];